//------------------------------------------------------------------------------------------------
//	2025 STL 화56목78	3월 18일 화요일				(3주 1일)
//------------------------------------------------------------------------------------------------
//	많은 수의 자료를 처리하기	-	Dog를 읽고 쓴다. read/write
//------------------------------------------------------------------------------------------------
#include <iostream>
#include<string>
#include "save.h"
using namespace std;

class Dog {
public:
	Dog() {
		// 다음 시간에 만들어 보겠습니다.
	}
private:
	string name;		// 32
	size_t id;			// 8
};

//	Dog 만마리를 생성하여 파일에 저장(write). 메모리로 읽어와서 처리(정렬).

//---------
int main() 
//---------
{
	save("main.cpp");
}