//------------------------------------------------------------------------------------------------
//	2025 STL 화56목78	4월 8일 화요일				(6주 1일)
//	중간고사	(30) -	4월 24일(8주 2일) 목요일
//	과제		(30) -	4월 10일 설명
//------------------------------------------------------------------------------------------------
//	STRING - std::string과 유사한 클래스, STL 표준 컨테이너가 되도록..
//			 내부 동작을 관찰할 수 있게 하자.
//------------------------------------------------------------------------------------------------
#include <iostream>
#include<array>
#include<algorithm>
#include"STRING.h"
#include "save.h"
using namespace std;

extern bool 관찰;				// 관찰하려면 true로

//---------
int main() 
//---------
{
	//	다음 시간에는 STRING도 이렇게 동작하게 하자
	string s{ "표준 string" };
	string t = move(s);

	cout << s << endl;
	cout << t << endl;

	save("main.cpp");
	//save("STRING.h");
	//save("STRING.cpp");
}