//------------------------------------------------------------------------------------------------
//	2025 STL 화56목78				5월 20일 화요일					(11주 2일)
//	6월 19일 목요일 15주 2일 - 기말시험
//------------------------------------------------------------------------------------------------
//	반복자와 알고리즘의 관계
//------------------------------------------------------------------------------------------------
#include <iostream>
#include<algorithm>
#include<vector>
#include"STRING.h"
#include "save.h"
using namespace std;

extern bool 관찰;				// 관찰하려면 true로 설정

template<class 반복자, class 목적지반복자>
void my_copy(반복자 b, 반복자 e, 목적지반복자 d)
{
	while (b != e) {
		*d = *b;	//*d++ = *b++;
		++d;
		++b;
	}
}

//---------
int main() 
//---------
{
	STRING s{ "반복자를 사용한 알고리즘을 연습 중" };
	vector<char> v{ '1' };

	my_copy(s.begin(), s.end(),back_inserter(v));	

	save("main.cpp");
}